loadtest/results/20260922-123858/1-no-cache.txt
Running 1m test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 105.177ms, rate sampling interval: 230ms
  Thread calibration: mean lat.: 106.674ms, rate sampling interval: 232ms
  Thread calibration: mean lat.: 103.515ms, rate sampling interval: 301ms
  Thread calibration: mean lat.: 106.702ms, rate sampling interval: 231ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   121.91ms  107.50ms   2.06s    95.96%
    Req/Sec   125.23     91.76   379.00     69.51%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   93.63ms
 75.000%  116.99ms
 90.000%  160.90ms
 99.000%  758.27ms
 99.900%    1.08s 
 99.990%    1.74s 
 99.999%    2.07s 
100.000%    2.07s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      73.023     0.000000            1         1.00
      81.279     0.100000         2555         1.11
      83.711     0.200000         5050         1.25
      86.335     0.300000         7523         1.43
      89.535     0.400000         9993         1.67
      93.631     0.500000        12523         2.00
      95.935     0.550000        13764         2.22
      98.495     0.600000        14989         2.50
     101.695     0.650000        16244         2.86
     106.431     0.700000        17483         3.33
     116.991     0.750000        18727         4.00
     123.711     0.775000        19356         4.44
     131.199     0.800000        19975         5.00
     137.855     0.825000        20606         5.71
     145.151     0.850000        21225         6.67
     152.959     0.875000        21861         8.00
     157.311     0.887500        22160         8.89
     160.895     0.900000        22481        10.00
     163.839     0.912500        22794        11.43
     167.807     0.925000        23096        13.33
     173.951     0.937500        23408        16.00
     178.687     0.943750        23564        17.78
     189.311     0.950000        23719        20.00
     215.295     0.956250        23875        22.86
     259.071     0.962500        24031        26.67
     323.327     0.968750        24187        32.00
     374.783     0.971875        24265        35.56
     431.359     0.975000        24344        40.00
     486.143     0.978125        24421        45.71
     576.511     0.981250        24499        53.33
     657.919     0.984375        24578        64.00
     673.791     0.985938        24617        71.11
     682.495     0.987500        24655        80.00
     713.215     0.989062        24694        91.43
     773.119     0.990625        24734       106.67
     803.839     0.992188        24774       128.00
     807.423     0.992969        24795       142.22
     811.007     0.993750        24811       160.00
     824.319     0.994531        24831       182.86
     840.703     0.995313        24850       213.33
     852.479     0.996094        24870       256.00
     855.039     0.996484        24881       284.44
     856.575     0.996875        24891       320.00
     894.463     0.997266        24899       365.71
     943.103     0.997656        24909       426.67
    1016.319     0.998047        24919       512.00
    1036.799     0.998242        24924       568.89
    1044.479     0.998437        24928       640.00
    1056.767     0.998633        24933       731.43
    1070.079     0.998828        24940       853.33
    1075.199     0.999023        24943      1024.00
    1087.487     0.999121        24947      1137.78
    1093.631     0.999219        24948      1280.00
    1137.663     0.999316        24950      1462.86
    1201.151     0.999414        24953      1706.67
    1224.703     0.999512        24955      2048.00
    1332.223     0.999561        24957      2275.56
    1355.775     0.999609        24958      2560.00
    1362.943     0.999658        24959      2925.71
    1393.663     0.999707        24960      3413.33
    1427.455     0.999756        24961      4096.00
    1479.679     0.999780        24962      4551.11
    1489.919     0.999805        24963      5120.00
    1489.919     0.999829        24963      5851.43
    1646.591     0.999854        24964      6826.67
    1646.591     0.999878        24964      8192.00
    1744.895     0.999890        24965      9102.22
    1744.895     0.999902        24965     10240.00
    1744.895     0.999915        24965     11702.86
    1949.695     0.999927        24966     13653.33
    1949.695     0.999939        24966     16384.00
    1949.695     0.999945        24966     18204.44
    1949.695     0.999951        24966     20480.00
    1949.695     0.999957        24966     23405.71
    2065.407     0.999963        24967     27306.67
    2065.407     1.000000        24967          inf
#[Mean    =      121.913, StdDeviation   =      107.503]
#[Max     =     2064.384, Total count    =        24967]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29698 requests in 1.00m, 9.56MB read
  Non-2xx or 3xx responses: 9171
Requests/sec:    492.71
Transfer/sec:    162.47KB
------------------------------
X-Cache  HIT=0  MISS=0  BYPASS=20527  writes=0  http_errors=9171
Socket errors: connect=0 read=0 write=0 timeout=0
p50       93.63 ms
p90      160.90 ms
p99      758.27 ms
p99.9   1075.20 ms