loadtest/results/20260922-123858/2-cache-aside.txt
Running 1m test @ https://cache-api-alb-1567239145.us-east-1.elb.amazonaws.com
  4 threads and 200 connections
  Thread calibration: mean lat.: 100.714ms, rate sampling interval: 222ms
  Thread calibration: mean lat.: 99.097ms, rate sampling interval: 224ms
  Thread calibration: mean lat.: 101.116ms, rate sampling interval: 239ms
  Thread calibration: mean lat.: 101.884ms, rate sampling interval: 225ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   131.29ms   91.38ms 755.20ms   87.90%
    Req/Sec   125.00     89.37   450.00     50.80%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   92.16ms
 75.000%  128.45ms
 90.000%  239.87ms
 99.000%  493.06ms
 99.900%  741.38ms
 99.990%  755.20ms
 99.999%  755.71ms
100.000%  755.71ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      70.527     0.000000            1         1.00
      81.599     0.100000         2557         1.11
      84.095     0.200000         4990         1.25
      86.399     0.300000         7486         1.43
      89.023     0.400000         9983         1.67
      92.159     0.500000        12484         2.00
      94.207     0.550000        13733         2.22
      96.959     0.600000        14965         2.50
     101.311     0.650000        16215         2.86
     108.671     0.700000        17451         3.33
     128.447     0.750000        18695         4.00
     140.671     0.775000        19318         4.44
     156.543     0.800000        19941         5.00
     173.055     0.825000        20562         5.71
     188.031     0.850000        21187         6.67
     219.007     0.875000        21808         8.00
     230.527     0.887500        22120         8.89
     239.871     0.900000        22432        10.00
     267.263     0.912500        22746        11.43
     286.975     0.925000        23056        13.33
     304.895     0.937500        23366        16.00
     338.431     0.943750        23525        17.78
     356.863     0.950000        23677        20.00
     382.463     0.956250        23835        22.86
     391.679     0.962500        23992        26.67
     409.343     0.968750        24147        32.00
     415.999     0.971875        24224        35.56
     431.871     0.975000        24303        40.00
     443.903     0.978125        24380        45.71
     449.279     0.981250        24458        53.33
     462.591     0.984375        24534        64.00
     472.575     0.985938        24574        71.11
     481.791     0.987500        24613        80.00
     491.263     0.989062        24652        91.43
     494.079     0.990625        24690       106.67
     497.663     0.992188        24731       128.00
     499.455     0.992969        24749       142.22
     505.087     0.993750        24769       160.00
     514.303     0.994531        24787       182.86
     525.823     0.995313        24807       213.33
     543.743     0.996094        24826       256.00
     552.959     0.996484        24836       284.44
     564.223     0.996875        24846       320.00
     582.143     0.997266        24855       365.71
     605.183     0.997656        24865       426.67
     632.319     0.998047        24875       512.00
     645.631     0.998242        24880       568.89
     707.583     0.998437        24885       640.00
     722.431     0.998633        24889       731.43
     737.279     0.998828        24894       853.33
     742.911     0.999023        24900      1024.00
     747.007     0.999121        24902      1137.78
     748.031     0.999219        24904      1280.00
     749.055     0.999316        24909      1462.86
     749.055     0.999414        24909      1706.67
     749.567     0.999512        24914      2048.00
     749.567     0.999561        24914      2275.56
     749.567     0.999609        24914      2560.00
     750.079     0.999658        24916      2925.71
     750.079     0.999707        24916      3413.33
     750.591     0.999756        24917      4096.00
     751.103     0.999780        24918      4551.11
     754.175     0.999805        24920      5120.00
     754.175     0.999829        24920      5851.43
     754.175     0.999854        24920      6826.67
     754.175     0.999878        24920      8192.00
     755.199     0.999890        24922      9102.22
     755.199     0.999902        24922     10240.00
     755.199     0.999915        24922     11702.86
     755.199     0.999927        24922     13653.33
     755.199     0.999939        24922     16384.00
     755.199     0.999945        24922     18204.44
     755.199     0.999951        24922     20480.00
     755.199     0.999957        24922     23405.71
     755.711     0.999963        24923     27306.67
     755.711     1.000000        24923          inf
#[Mean    =      131.289, StdDeviation   =       91.376]
#[Max     =      755.200, Total count    =        24923]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  29792 requests in 1.00m, 10.09MB read
  Non-2xx or 3xx responses: 3371
Requests/sec:    494.27
Transfer/sec:    171.49KB
------------------------------
X-Cache  HIT=21222  MISS=5199  BYPASS=0  writes=0  http_errors=3371
Cache hit ratio: 80.32%
Socket errors: connect=0 read=0 write=0 timeout=0
p50       92.16 ms
p90      239.87 ms
p99      493.06 ms
p99.9    741.38 ms